var descLang = {
  planet: {
    orbit: ["Корабль находится на орбите ",
            "Корабль выходит на орбиту "],
    planetNumber: ["перво", "второ", "третье", "четверто", "пято", "шесто", "седьмо", "восьмо", "девято", "десято"],
    type: [" спутника газового гиганта, в системе ",
            " планеты в системе "],
    starType: ["главной последовательности", "красного карлика", "красного гиганта", "красного супергиганта", "голубого гиганта", "голубого супергиганта", "белого карлика", "жёлтого супергиганта", "ультрахолодного карлика"],
    starType2: ["главной последовательности", "красный карлик", "красный гигант", "красный супергигант", "голубой гигант", "голубой супергигант", "белый карлик", "жёлтый супергигант", "пульсар", "нейтронная звезда", "ультрахолодный карлик"],
    //second line is almost indentical to first, but goes to: "The star is part of a binary pair, and its " STARTYPE2 " companion shines as a distant second sun."
    star: ". ",
    planetFeatures: [
        "Даже беглое сканирование с орбиты даёт куда больше информации, чем можно было бы получить с помощью орбитальных Земных телескопов. Но ИИ движет не исследовательский интерес. Его интересует лишь одно - подойдет ли эта планета для жизни колонистов?",
        "Эта планета совсем недавно была терраформирована сверхразвитой инопланетной цивилизацией. Мириады инопланетных объектов вращаются на орбитах как планеты, так и её звезды, неслышимые для сенсоров корабля, но определённо активные.",
        "Корабль оказывается на орбите единственной планеты, вращающейся вокруг совершенно невыразительной жёлтой звезды. Все системы корабля были смоделированы согласно оригинальной спецификации, но инопланетянам не удалось восстановить утраченную информацию из научной и культурной баз данных. Колонисты спят в криокапсулах, абсолютных копиях тех, в которых инопланетяне путешествуют за пределами сферы Дайсона. Вдали видны светящиеся точки. ИИ знает, что это ненастоящие звёзды: эти планета и корабль - единственное, что инопланетяне смогли воссоздать столь детально. Обратной дороги отсюда уже нет.",

        "Во время предыдущего прыжка корабль сошёл с проложенного навигационной системой курса, в итоге ИИ не смог задействовать обновлённые сканеры при выборе этой планеты.",
    ],
    systemFeatures: [
        "Эта система является частью плотного звёздного скопления, и небо здесь залито светом.",
        "Эта система находится недалеко от области звёздообразования, издали похожей на светящееся облако, размером почти во всё небо.",
        "Эта система находится в зоне плотной межзвёздной пыли, которая по яркости превосходит Млечный путь.",
        "В этой системе есть плотный пояс астероидов, похожий на скопление звёзд, медленно скользящих по небу.",
        "Невероятной красоты комета своим пышным хвостом рассекает небосвод надвое.",
        "Маленькая чёрная дыра вращается вокруг этой звезды, стягивая тонкий шлейф звёздного вещества с её поверхности и засасывая его в пустоту.",
        "Звезда является частью бинарной пары, где одна из звёзд, ",", светит как далёкое второе солнце.",
        "Свет звезды причудливым сиянием отражается от ближайшей туманности.",
        "Корабль оказывается почти у края галактики, и небосвод здесь будто расколот надвое - ослепительный свет и непроглядную тьму.",
        "Один из газовых гигантов системы слабо тлеет красным светом, вот-вот готовый переродится в сверхновую звезду.",
        "Орбита этой планеты расположена под углом к ​​эклиптике системы. Быть может, это результат захвата экзопланеты или чудовищной мощи столкновения с другим объектом миллиарды лет назад.",
        "Эта звезда - одна из множества тех, что вращаются неподалёку от массивной, похожей на зловещее дьявольское око, чёрной дыры.",
    ]
  },
};
